[
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "225",
    "lastPage": "239",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Modelling the Growth of Literature in the Area of Chemical Sciences",
    "authors": "Kumar Suresh1, Gupta B M1",
    "authorDes": "1National Institute of Science, Technology and Development Studies, Dr K S Krishnan Marg, New Delhi-110012.",
    "abstract": "The article reviews the different approaches for studying the growth of scientific knowledge, as reflected by publications. It studies and explores the applicability of selected growth models in the growth of the world research output in the form of papers, patents and books in the field of chemical sciences during 1907–1999. Also studies the criteria on which growth models are to be selected for their possible applications in the field of chemical science literature.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "240",
    "lastPage": "250",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Contribution of Cities, States and Regions in Indian LIS Journals From 1991 to 2000",
    "authors": "Roy Protap Chandra1",
    "authorDes": "1Development Alternatives, B-32, Tara Crescent, Qutab Institutional Area, New Delhi 110 016.",
    "abstract": "This study is based on 1637 research papers in Library and Information Science (LIS) published in 10 Indian LIS journals during the period 1991 to 2000, LIS research and study is concentrated in ten cities mainly viz., Delhi, Bangalore, Hyderabad, Kolkata, Mumbai, Lucknow, Amritsar, Bhubaneswar, Madras, Dharwad, Thiruvananthapuram, though the analysis of published literature on LIS indicates that Indian research activities in the field of LIS are distributed over several geographical regions. The northern, southern regions have strong base, while the western, eastern, north eastern & central region have made very marginal contributions, The six major states contributing LIS articles are: Delhi, Karnataka, Uttar Pradesh, Andhra Pradesh, West Bengal, and Maharastra.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "251",
    "lastPage": "258",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "e-Journal Portals: A Web Retrieval Tool for Scholarly Communication in Digital Era",
    "authors": "Singh KP1, Lecturer",
    "authorDes": "1Department of Library and Information Science, University of Delhi, Delhi-110007. e-mail: singhkp_1972@yahoo.co.in",
    "abstract": "Information Communication Technology (ICT) and its offshoots technologies such as Internet, Intranet, www, Web directories, Web portals, and E-portals, etc. have palyed a significant role in the libraries and information centres. The new emerging technology like E-journals portals have played a marvelous role in acquisition and dissemination of full-text information to libraries at a minimal cost. The present paper discusses the various facets and issues of E-portal journals in detail.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "259",
    "lastPage": "274",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Knowledge Management: A Growing Discipline",
    "authors": "Thakur D S1, DR, Documentation Officer, Thakur K S2, Librarian",
    "authorDes": "1National Institute of Educational Planning and Administration (NIEPA), 17-B, Sri Aurobindo Marg, New Delhi-110016. E-mail: dsthakur@hotmail.com2Punj Lloyd Limited, 17–18, Nehru Place, New Delhi-110019. E-mail: ksthakur@punjlloyd.com",
    "abstract": "This paper presents the role of knowledge management in business, learning and research organizations. It is a need of the hour to big, medium, small and all kinds of organizations to cope with the challenges of knowledge management in the new century. Tacit knowledge is a pivotal point of organizational learning and focuses on the role of tacit knowledge in the business, industry, research and learning organizations. Conversion of tacit knowledge into explicit knowledge and vice versa is the requirement of present and future industries and research organizations. Knowledge management is a strategy and shows a path how to face the global challenges in most accelerated information technology world. It gives a message - “If they don't they won't survive”.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "275",
    "lastPage": "280",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Management of e-Journals in Digital Environment",
    "authors": "Raza M Masoom1, DR, Lecturer, Eqbal Monawwer1, Research Scholar",
    "authorDes": "1Department of Library & Information Science, Aligarh Muslim University, Aligarh (UP), India.",
    "abstract": "Over the years there been a rapid rise in the number of e-journals. In most of the cases these journals are available free to print subscribers. The management of e-journals raises a new set of issues needing urgent attention. The issues surrounding can be resolved through collective efforts and cooperation of librarians, publishers and the vendors of e-journals.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "281",
    "lastPage": "286",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Journal of Rock Mechanics and Tunnelling Technology: A Bibliometric Analysis",
    "authors": "Senapati S K1, Library Officer, Central Officer",
    "authorDes": "1Central Building Research Institute, Roorkeer 247 667.",
    "abstract": "The paper deals with a bibliometric study on ‘Journal of Rock Mechanics and Tunnelling Technology’ during the period of 1998–2002. It examines year wise distribution of papers, authorship pattern, affiliation and country wise distribution. It also shows subject wise break-up of articles, citation pattern and illustration.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "287",
    "lastPage": "311",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "MLIS Dissertation Practices in Selected Indian Universities: A Survey",
    "authors": "Kadwey Bharti, Kesarwani S K",
    "authorDes": "72-B, Tapovan Complex, Jaiprakash Nagar, Nagpur-440 025.",
    "abstract": "The study is based on the survey conducted of the MLIS Dissertation practices in 15 Indian universities. A five part questionnaire was developed and sent to 29 universities, out of which 17 universities responded to the questionnaires. The analysis of data reveals great variations in the practices being followed in selection and allotment of topics, methodology for preparation and presentation, system of evaluation and assessment of dissertations and Viva-voce examination (where associated with the evaluation of dissertations). There is a consensus among universities to treat Dissertation, as an integral part of MLIS syllabus in all universities and it must be made compulsory in Universities where it is elective at present. Recommends avoidance of duplication in selection of topics and suggests creation of database of Dissertations submitted in LIS schools in a city at local level and bibliographical control of MLIS Dissertations at National level; evolving of suitable policy for allowing students to prepare and submit dissertations in regional languages, where MLIS education is being imparted in such languages. It is also recommended that some standardization may be achieved in the matter of evaluation system for Dissertations. Some guidelines by bodies like UGC, are considered necessary in this regard.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "312",
    "lastPage": "319",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "A Survey of the College and University www Sites of Shillong, Meghalaya",
    "authors": "Laloo Bikika Tariang1, Lecturer",
    "authorDes": "1Department of Library and Information Science, North Eastern Hill University, Shillong, Meghalaya 793 014. E-mail: bikilaloo@rediffmail.com",
    "abstract": "This paper examines the websites of five academic institutions (one university and four colleges) emerging from Shillong in Meghalaya to determine whether they are able to make their digital presence felt on the World Wide Web. The websites were analyzed and their content, design, multimedia features and currency evaluated. It was found that the websites coming from this so called remote part of the country are quite up to the mark and can easily give those of bigger cities a run for their money.",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "320",
    "lastPage": "321",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Friends of the Library in India - GAIL Donation for MUL",
    "authors": "Prof Jain H C, Ex-Librarian",
    "authorDes": "University of Delhi, S-11, Parwana Vihar, Sector 9, Rohini, Delhi 110 085.",
    "abstract": "",
    "keywords": ""
  },
  {
    "year": "2003",
    "volume": "41",
    "issue": "4",
    "firstPage": "194",
    "lastPage": "199",
    "printISSN": "0024-2292",
    "onlineISSN": "0976-2469",
    "doi": null,
    "heading": "Changing Role of the Libraries in Contemporary Society",
    "authors": "Burman Joginder Singh1",
    "authorDes": "1Department of Library & Information Science, Bundelkhand University, Jhansi-284 128 (U.P).",
    "abstract": "Points out about changes taking place in the twenty first century. Discuss changed concept of the library. Describes the concept of Information Society. Brings out the implication of information for development. Describes the changing role of the libraries and national development. Concludes that libraries have special significance in the changing environment.",
    "keywords": ""
  }
]